#include <MsTimer2.h> // підключення бібліотеки для використання переривань по таймеру

byte LEDS[8] = {9, 8, 7, 6, 5, 4, 3, 2}; // піни для підключення світлодіодів
int n = 0; // лічильник номеру світлодіоду, який буде вмикатися, початковий - 0
int w_time = 1000; // час світіння світлодіоду в мілісекундах

void setup() {
  for (int i=0; i<=7; i++) { // задання пінів на вихід через цикл
    pinMode (LEDS[i], OUTPUT); 
    digitalWrite(LEDS[i], LOW);
  }
  digitalWrite(LEDS[n], HIGH); // ввімкнути перший світлодіод

  MsTimer2::set(w_time, changeLed); // задаємо виклик функції changeLed з інтервалом w_time
  MsTimer2::start(); // дозволяємо переривання по таймеру
}

void loop() {
  // будь який-код...
}

// переривання
void  changeLed() {
  digitalWrite(LEDS[n], LOW); // погасити попередній світлодіод
  if (n < 7) { // якщо лічильник світлодіодів не переповнений (менше 7)
    n = n + 1;  // інкрементувати лічильник
  }
  else { // якщо лічильник переповнився
    n = 0; // обнулити лічильник
  }
  digitalWrite(LEDS[n], HIGH); // ввімкнути наступний світлодіод
}
